In [20]:
import pandas as pd
import numpy as np

In [21]:
data1 = "data/toyo_students.csv"

In [22]:
df = pd.read_csv(data1,sep=",",skiprows=1)

In [23]:
print(df.shape)
print(df.info())
display(df.head())

(4, 4)
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4 entries, 0 to 3
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Campus  4 non-null      object
 1   Male    4 non-null      int64
 2   Female  4 non-null      int64
 3   Sum     4 non-null      int64
dtypes: int64(3), object(1)
memory usage: 256.0+ bytes
None

       Campus   Male  Female    Sum
0     Hakusan  11204    9199  20403
1     Kawagoe   3845     858   4703
2     Itakura    996     865   1861
3  Akabanedai   2183    1697   3880

In [24]:
arr = df.to_numpy()
print(arr)

[['Hakusan' 11204 9199 20403]
 ['Kawagoe' 3845 858 4703]
 ['Itakura' 996 865 1861]
 ['Akabanedai' 2183 1697 3880]]

In [25]:
df.at[0,"Male"]

11204

In [26]:
df.at[3,"Sum"]

3880

In [27]:
df.at[1,"Male"] = 3850

In [28]:
df.at[1,"Sum"] = 4780

In [29]:
display(df)

       Campus   Male  Female    Sum
0     Hakusan  11204    9199  20403
1     Kawagoe   3850     858   4780
2     Itakura    996     865   1861
3  Akabanedai   2183    1697   3880

In [30]:
display(arr)

array([['Hakusan', 11204, 9199, 20403],
       ['Kawagoe', 3845, 858, 4703],
       ['Itakura', 996, 865, 1861],
       ['Akabanedai', 2183, 1697, 3880]], dtype=object)